---
kind: other
id: Methods.T:Autodesk.Revit.DB.INavisworksExporter
source: html/d8739a01-5b3c-4ec1-bd8d-051d9de475ef.htm
---
# INavisworksExporter Methods

The method that Revit will invoke to perform an export to Navisworks.